#ifndef classify_hospital_defs_h
#define classify_hospital_defs_h
#include<iostream>
using namespace std;

const int HOSPITALCATENUM = 1;
const int GENERAL = 0;

//"卫生服务站","卫生服务中心","卫生服务点","卫生服务所","卫生服务指导中心","卫生服务室","卫生服务社"
const int GENERALNUM = 62;
string general_hospital[GENERALNUM] = {"医院","醫院","老年健康服务中心","医疗室","卫生保健所","卫生院","卫生站","卫生室","卫生所","保健站","医疗站","医疗服务站","医疗所","卫生中心","疗养所","保健所","保健服务站","合作医疗社区服务站","卫生工作站","医务室","定点医疗机构","健康院","医务所","中心院","卫生综合服务点","卫生分站","卫生保健室","疗养院","防保所","卫生总站","卫生队","防保站","健康服务站","社康","医务院","医馆","诊疗院","社区计卫联手服务站","医科院","卫生处","妇保院","保健院","治疗中心","医疗中心","医寓","医务站","卫生点","医疗点","医疗部","医疗服务点","社区卫生","卫生服务","社区医疗","公共卫生","社区健康","卫生社区服务","卫生防保所 ","卫生防保站","诊疗室","诊室","诊疗所","诊所"};

const int SPECNUM = 8;
string spec_hospital[SPECNUM] = {"科医院","病医院","口腔医院","肿瘤医院","肛肠医院","耳鼻喉医院","产院","麻风医院"};

const int DISSPREVENUM = 11;
string diss_preve[DISSPREVENUM] = {"防所","防治","预防控制","防疫","预防保健","疾控","预防站","卫生防病站","疾病控制","预防接种","防站"};

const int ABBRESPECNUM = 17;
string abbre_spec_hospital[ABBRESPECNUM] = {"传染病院","牙所","精神病院","麻疯病院","麻风院","牙业","麻风病院","牙馆","脚病修治所","镶牙","专治","牙社","牙院","牙店","洗牙","美牙","洁牙"};

const int PHARMACYNUM = 31;
string pharmacy[PHARMACYNUM] = {"医药","药连锁","健康专卖店","药店","药房","药堂","药材店","药品零售","药局","药馆","药号","药品超市","药铺","药品商店","药站","药商店","药品柜","药材站","药材商行","药行","药柜","药材商店","药采供站","药服务站","药材购销站","药商场","药服务社","保健用品专卖","保健品商行","草药坊","药库"};

const int EMERGENCYNUM = 11;
string emergency[EMERGENCYNUM] = {"急救","救护","救援","血站","血浆院","血液中心","血浆站","抢救","献血屋","储血室","血库"};

const int REPRODUCTNUM = 3;
string reproduct[REPRODUCTNUM] = {"计生","生殖","计划生育"};

const int CLINICNUM = 4;
string clinic[CLINICNUM] = {"诊所","诊疗室","诊室","诊疗所"};

/*
const int HOSKEY = 28;
string hos_key[HOSKEY] = {"住院部","胃镜室","磁共振室","特诊部","心电图室","影像诊断中心","微创诊疗中心","高压氧治疗中心","CT检查中心","体验中心","观察室","肿瘤治疗中心","临床检验中心","中西结合治疗中心","产前筛查中心","放疗中心","结核病中心","肝病结核中心","体检中心","骨伤治疗中心","急诊中心","心脏中心","痔瘘治疗中心","会诊中心","螺旋CT检查室","体检处","CT室","口腔治疗中心"};
*/
const int HOSKEY = 1;
string hos_key[HOSKEY] = {"体检处"};

const int ABBREHOSNUM = 20;
string abbre_hospital[ABBREHOSNUM] = {"门诊","医疗","中医","中西医","分院","康复","社区工作站","社区服务站","社区服务中心","诊疗","社区服务点","社区服务分站","社区服务处","社区服务部","社区服务指导中心","社区服务工作站","卫生社","急诊","健康中心","保健中心"};

const int CENTERNUM = 2;
string center[CENTERNUM] = {"社区服务指导中心","社区服务中心"};
/*
const int CENTERNUM = 14;
string center[CENTERNUM] = {"健康服务中心","卫生中心","卫生社区服务中心","卫生服务","社区卫生保健服务中心","社区医疗服务中心","社区服务分中心","公共卫生分中心","社康服务中心","社康中心","社区卫生中心","社区服务中心","社区服务指导中心","社区健康中心"};
*/
const int ABBREAREANUM = 3;
string abbre_area[ABBREAREANUM] = {"楼","病区","病房"};

const int DEPARTMENTNUM = 130;
string department[DEPARTMENTNUM] = {"检验科","牙科","感染科","放射科","结石病专科","风湿病专科","妇产科","创伤显微外科","外外科","妇科","中医专科","设备科","烧伤专科","儿科","眼病专科","骨伤专科","皮肤病专科","口腔科","齿科","骨科","中医内科","整形外科","脉管炎专科","糖尿病专科","整形美容外科","血管病科","耳鼻喉专科","胆道外科","肛肠专科","西医外科","颈肩腰腿痛专科","中医推拿康复科","针灸康复科","颈肩腰腿痛康复科","肠道科","中医中药科","面瘫治疗专科","生殖泌尿专科","中医科","痔瘘结肠炎专科","老年病专科","皮肤科","甲状腺专科","冠心病专科","鼻炎专科","中医科","牙病专科","男科","骨伤科","眼科","整形美容科","内分泌科","男性科","伤疯科","肛肠痔瘘专科","血液科","颈肩腰腿痛科","痔瘘专科","心脑血管病专科","颈肩腰痛专科","静脉曲张专科","皮科","前列腺腰痛病专科","高压氧科","外科","跌打伤科","皮肤激光科","推拿针灸科","放疗科","颈腰专科","精神科","骨伤病重点专科","颈腰椎病专科","肠粘连专科","感染内科","鼻炎科","统计信息科","营养科","体检科","骨质增生专科","皮肤性病防治专科","肛肠科","男子专科","颈腰腿痛专科","影像科","风湿骨病疼痛专科","跌骨打科","腰腿疼专科","精神病专科","皮肤专科", "风湿骨病专科","毛发移植科","泌尿生殖专科","肝病专科","皮肤泌尿科","感染性疾病科","五官专科","全科","跌打科","类风湿专科", "肛肠病专科","腿病科","牙齿专科","脑瘤子宫肌瘤专科","核医学科","烫伤专科","喉科","胃病专科","中风专科","病理科","医学工程科","精神病科","综合内科","理疗科","灰指甲专科","药剂科","药浴科","五官科","肾病专科","脚气专科","肝胆专科","妇幼科","胃肠专科","椎间盘专科","腰腿病治疗专科","肝胆专科","妇幼科","中耳炎专科","伤科","妇儿专科"};

const int COMMUNITYHEALTHNUM = 51;
string community_health[COMMUNITYHEALTHNUM] = {"老年健康服务中心","医疗室","卫生保健所","卫生院","卫生站","卫生室","卫生所","保健站","医疗站","医疗服务站","医疗所","卫生中心","疗养所","保健所","保健服务站","合作医疗社区服务站","卫生工作站","医务室","定点医疗机构","健康院","医务所","卫生综合服务点","卫生分站","卫生保健室","疗养院","防保所","卫生总站","卫生队","防保站","健康服务站","社康","医务院","医馆","社区计卫联手服务站","卫生处","治疗中心","医疗中心","医寓","医务站","卫生点","医疗点","医疗部","医疗服务点","社区卫生","卫生服务","社区医疗","公共卫生","社区健康","卫生社区服务","卫生防保所 ","卫生防保站"};

const int HOSCOMNUM = 3;
string hos_community[HOSCOMNUM] = {"社区服务","社区站","社区工作"};

const int HEALTHSERVICE = 8;
string health[HEALTHSERVICE] = {"站","中心","点","所","指导中心","室","社","基地"};

const int BRANCH = 15;
string branch[BRANCH] = {"分院","分部","分诊部","分中心","服务中心","服务站","分点","服务部","分站","分室","院区","总院","分所","院部","本部"};

const int AREANUM = 10;
string area[AREANUM] = {"北院","南院","东院","西院","新院","老院","东区","北区","南区","西区"};

//const int DOORNUM = 10;
//string door_hos[DOORNUM] = {"东门","南门","北门","西门","正门","侧门","前门","后门","大门","小门"};

#endif
